FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_USBHost.c
}

/*
**************************************************************************************************************
*                                         READ BE 16U
*
* Description: This function is used to read an unsigned short integer from a charecter buffer in the platform
*              containing big endian processor
*
* Arguments  : pmem    Pointer to the charecter buffer
*
* Returns    : val     Unsigned short integer
*
**************************************************************************************************************
*/

TUInt16  ReadBE16U (volatile  TUInt8  *pmem)
{
    TUInt16  val;


    ((TUInt8 *)&val)[0] = pmem[1];
    ((TUInt8 *)&val)[1] = pmem[0];

    return (val);
}

/*
**************************************************************************************************************
*                                         WRITE BE 16U
*
* Description: This function is used to write an unsigned short integer into the charecter buffer in the
*              platform containing big endian processor
*
* Arguments  : pmem    Pointer to the charecter buffer
*              val     Value to be placed in the charecter buffer
*
* Returns    : None
*
**************************************************************************************************************
*/
void  WriteBE16U (volatile  TUInt8  *pmem,
                            TUInt16   val)
{
    pmem[0] = ((TUInt8 *)&val)[1];
    pmem[1] = ((TUInt8 *)&val)[0];
}
#endif

/*---------------------------------------------------------------------------*
 * Routine:  IAllocBuffer
 *---------------------------------------------------------------------------*
 * Description:
 *      Allocate data in the USB Data area (if room for allocation)
 * Inputs:
 *      T_LPC2478_USBHost_Workspace *p -- USB Host controller workspace
 *      TUInt32 aBufferSize         -- Number of bytes required
 * Outputs:
 *      void *                      -- Returned allocation, or 0 for out
 *                                      of memory.
 *---------------------------------------------------------------------------*/
static void *IAllocBuffer(
        T_LPC2478_USBHost_Workspace *p,
        TUInt32 aBufferSize)
{
    void *p_buffer = p->iAllocBase;

    // Determine if there is enough room
    if (p->iAllocRemaining < aBufferSize)
        return 0;

    // There is enough room
    // Move the base to the next location
    // and mark off the space used
    p->iAllocBase += aBufferSize;
    p->iAllocRemaining -= aBufferSize;

    // Return the original base address
    return p_buffer;
}

/*---------------------------------------------------------------------------*
 * Routine:  Host_AllocBuffer
 *---------------------------------------------------------------------------*
 * Description:
 *      Allocate USB memory.
 * Inputs:
 *      void *aWorkspace            -- USB Host controller workspace
 *      TUInt32 aSize               -- Number of bytes required
 * Outputs:
 *      void *                      -- Returned allocation, or 0 for out
 *                                      of memory.
 *---------------------------------------------------------------------------*/
static void *Host_AllocBuffer(void *aWorkspace, TUInt32 aSize)
{
    T_LPC2478_USBHost_Workspace *p = (T_LPC2478_USBHost_Workspace *)aWorkspace;
    return IAllocBuffer(p, aSize);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_USBHost_InitializeWorkspace_PortA
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the USB Host to work on Port A
 * Inputs:
 *      void *aWorkspace            -- USB Host controller workspace
 * Outputs:
 *      T_uezError                  -- Any error if failed
 *---------------------------------------------------------------------------*/
static T_uezError LPC2478_USBHost_InitializeWorkspace_PortA(void *aWorkspace)
{
    T_LPC2478_USBHost_Workspace *p = (T_LPC2478_USBHost_Workspace *)aWorkspace;
    p->iPortIndex = USB_HOST_PORT_INDEX_PORT_A;
    p->iPortStatus = &HcRhPort1Status;
    p->iAllocRemaining = 0; // Not ready yet
    p->iCallbackAPI = 0;
    p->iCallbackWorkspace = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_USBHost_InitializeWorkspace_PortB
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the USB Host to work on Port B
 * Inputs:
 *      void *aWorkspace            -- USB Host controller workspace
 * Outputs:
 *      T_uezError                  -- Any error if failed
 *---------------------------------------------------------------------------*/
static T_uezError LPC2478_USBHost_InitializeWorkspace_PortB(void *aWorkspace)
{
    T_LPC2478_USBHost_Workspace *p = (T_LPC2478_USBHost_Workspace *)aWorkspace;
    p->iPortIndex = USB_HOST_PORT_INDEX_PORT_B;
    p->iPortStatus = &HcRhPort2Status;
    p->iAllocRemaining = 0; // Not ready yet
    p->iCallbackAPI = 0;
    p->iCallbackWorkspace = 0;

    return UEZ_ERROR_NONE;
}

#if (COMPILER_TYPE==RowleyARM) 
    #define USB_HOST_ALLOC_SIZE    16*1024
    TUInt8 G_usbHostMemory[USB_HOST_ALLOC_SIZE]
        __attribute__((section(".usbram")));
#endif

/*---------------------------------------------------------------------------*
 * Routine:  Host_Init
 *---------------------------------------------------------------------------*
 * Description:
 *      Initializes the LPC2478 host controller with buffers
 * Inputs:
 *      void *aWorkspace            -- USB Host controller workspace
 *---------------------------------------------------------------------------*/
static T_uezError Host_Init(void *aWorkspace)
{
    extern void USBSharedInterruptSetup(void);
    T_LPC2478_USBHost_Workspace *p = (T_LPC2478_USBHost_Workspace *)aWorkspace;

#if (COMPILER_TYPE==RowleyARM) 
    // Setup memory from start
    p->iAllocBase = (TUInt8 *)G_usbHostMemory;
    p->iAllocRemaining = USB_HOST_ALLOC_SIZE;
#else
    // Setup memory from start
    p->iAllocBase = (TUInt8 *)0x7FD00000;
    p->iAllocRemaining = 8192;
#endif

