FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_USBHost.c
    if (error != UEZ_ERROR_NONE)
        return error;

    // Wait a little bit (2 ms)
    UEZBSPDelayMS(2);

    // Change the control to go to the address
    EDCtrl->Control = (EDCtrl->Control & (~0x7F)) | aAddress;

    return error;
}


/*---------------------------------------------------------------------------*
 * Routine:  Host_CtrlRecv
 *---------------------------------------------------------------------------*
 * Description:
 *      Receive control information.  Data is received in the common
 *      transfer descriptor (if aLength > 0).
 * Inputs:
 *      void *aWorkspace            -- USB Host controller workspace
 *      TUInt8 aBMRequestType       -- Type of request
 *      TUInt8 aRequest             -- Request
 *      TUInt16 aValue              -- Value for request
 *      TUInt16 aIndex              -- Index for request
 *      TUInt16 aLength             -- Length of data in command
 *                                      (currently in TDBuffer)
 * Outputs:
 *      T_uezError                  -- UEZ_ERROR_NONE if successful, else
 *                                      error code.
 *---------------------------------------------------------------------------*/
static T_uezError Host_CtrlRecv(
            void *aWorkspace,
            void *aBuffer,
            TUInt8 aDeviceAddress,
            TUInt8 aBMRequestType,
            TUInt8 aRequest,
            TUInt16 aValue,
            TUInt16 aIndex,
            TUInt32 aLength,
            TUInt32 aTimeout)
{
    T_uezError error;
    T_LPC2478_USBHost_Workspace *p = (T_LPC2478_USBHost_Workspace *)aWorkspace;

    IHost_FillSetup(p, aBMRequestType, aRequest, aValue, aIndex, aLength);
    error = Host_ProcessTD(aWorkspace, EDCtrl, TD_SETUP, TDBuffer, 8, aTimeout);
    if (error == UEZ_ERROR_NONE) {
        // Get the data (if any)
        if (aBuffer)
            error = Host_ProcessTD(aWorkspace, EDCtrl, TD_IN, aBuffer, aLength, aTimeout);

        // Send an ACK
        if (error == UEZ_ERROR_NONE)
            error = Host_ProcessTD(aWorkspace, EDCtrl, TD_OUT, 0, 0, aTimeout);
    }
    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Host_SetCallbacks
 *---------------------------------------------------------------------------*
 * Description:
 *      Declare callbacks for this workspace.
 * Inputs:
 *      void *aWorkspace            -- USB Host controller workspace
 *      void *aCallbackWorkspace    -- Workspace used when call back called
 *      const T_USBHostCallbacks *aCallbackAPI -- Structure holding callback
 *                                      routines to be called.
 * Outputs:
 *      T_uezError                  -- UEZ_ERROR_NONE if successful, else
 *                                      error code.
 *---------------------------------------------------------------------------*/
static T_uezError Host_SetCallbacks(
        void *aWorkspace,
        void *aCallbackWorkspace,
        const T_USBHostCallbacks *aCallbackAPI)
{
    T_LPC2478_USBHost_Workspace *p = (T_LPC2478_USBHost_Workspace *)aWorkspace;

    p->iCallbackAPI = aCallbackAPI;
    p->iCallbackWorkspace = aCallbackWorkspace;

    return UEZ_ERROR_NONE;
}

static T_usbHostDeviceState Host_GetState(void *aWorkspace)
{
    T_LPC2478_USBHost_Workspace *p = (T_LPC2478_USBHost_Workspace *)aWorkspace;
    return p->iState;
}

static void Host_ResetPort(void *aWorkspace)
{
    T_LPC2478_USBHost_Workspace *p = (T_LPC2478_USBHost_Workspace *)aWorkspace;

    UEZTaskDelay(100);

    // Apply port reset
    *p->iPortStatus |= OR_RH_PORT_PRS;

    // Wait for 100 MS after port reset
    UEZTaskDelay(100);

    // Default max packet size to 8 to ensure compatibility
    EDCtrl->Control = (8 << 16);
}

/*---------------------------------------------------------------------------*
 * Routine:  USBHost_SwitchPort
 *---------------------------------------------------------------------------*
 * Description:
 *      This command is a secret function and thoroughly a hack.
 *              PLEASE DO NOT USE THIS COMMAND!
 *      unless you are doing it for very special
 *      purposes.  In this case, we needed to test the host capability
 *      on 2 different connections in our tester and wanted to switch
 *      between Port A and Port B.  The problem is that the driver and the
 *      layers above are only setup for one port, not two.  To get a first
 *      round of testing, we created this command to switch over to one
 *      or the other and reset the devices plugged in by toggling
 *      the USBx_PPWRn lines (see IResetUSBHosts()).  This is
 *      not a good design and is only a hack.
 *      IT WILL BE REMOVED IN THE FUTURE!
 *
 *      NOTE: It also makes calls to UEZTaskDelay() which should not be
 *      done at this layer.
 *      NOTE: This command is special and will never be added to the API.
 * Inputs:
 *      void *aWorkspace            -- USB Host controller workspace
 * Outputs:
 *      T_uezError                  -- UEZ_ERROR_NONE if successful, else
 *                                      error code.
 *---------------------------------------------------------------------------*/
T_uezError USBHost_SwitchPort(void *aWorkspace, TUInt32 aPort)
{
    T_LPC2478_USBHost_Workspace *p = (T_LPC2478_USBHost_Workspace *)aWorkspace;
    T_uezError error = UEZ_ERROR_NONE;

    // Let's try this one!
    InterruptDisable(INTERRUPT_CHANNEL_USB);

    // Turn off OTG
    OTGClkCtrl = 0;

    // Turn off the power!
    PCONP &= ~0x80000000;

    // Force a disconnected state on the system -- even do the callback
    p->iState = USB_HOST_STATE_DISCONNECTED;
    if (aPort == 0) {
        p->iPortIndex = USB_HOST_PORT_INDEX_PORT_A;
        p->iPortStatus = &HcRhPort1Status;
    } else if (aPort == 1) {
        p->iPortIndex = USB_HOST_PORT_INDEX_PORT_B;
        p->iPortStatus = &HcRhPort2Status;
    }
    // More hacks
    G_usbHostWorkspacePortA = aWorkspace;
    G_usbHostWorkspacePortB = 0;

    error = Host_Init(aWorkspace);
    if (!error) {
        // Wait a little bit (1 seconds)
        UEZTaskDelay(1000);
        Host_ResetPort(aWorkspace);
        // Wait a little bit (1 seconds)
        UEZTaskDelay(1000);
    }

    InterruptEnable(INTERRUPT_CHANNEL_USB);

