FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_USBHost.c
    // Force the power pins off P0[12] and P1[19]
    // P0[12] set to GPIO output and push HIGH (disabled)
    PINSEL0 &= ~(3<<24);
    IO0DIR |= 1<<12;
    IO0SET = 1<<12;

    // P1[19] set to GPIO output and push HIGH (disabled)
    PINSEL3 &= ~(3<<6);
    IO1DIR |= 1<<19;
    IO1SET = 1<<19;

    // USB2_PWRD

    // Change USB1_PWRD/P0[21] from input to output to ground
    IO0CLR = 1<<21;
    IO0DIR |= 1<<21;

    // Change USB2_PWRD/P1[30] from input to output to ground
    PINSEL3 &= ~(1<<28);
    IO1CLR = 1<<30;
    IO1DIR |= 1<<30;

    // Wait a little bit (1 seconds)
    UEZTaskDelay(1000);

    // Now return back to normal mapping (controlled by USB)
    PINSEL0 |= 1<<24;
    PINSEL3 |= 2<<6;

    // Change USB1_PWRD/P0[21] back to input
    IO0DIR &= ~(1<<21);

    // Change USB2_PWRD/P1[30] back to USB_PWRD2
    PINSEL3 |= (1<<28);

    // Wait a little bit (0.2 seconds)
    UEZTaskDelay(200);

    return error;
}

T_uezError Host_Control(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt8 aBMRequestType,
            TUInt8 aRequest,
            TUInt16 aValue,
            TUInt16 aIndex,
            TUInt16 aLength,
            void *aBuffer,
            TUInt32 aTimeout)
{
    return Host_CtrlRecv(
            aWorkspace,
            aBuffer,
            aDeviceAddress,
            aBMRequestType,
            aRequest,
            aValue,
            aIndex,
            aLength,
            aTimeout);
}

T_uezError Host_GetDescriptor(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt8 aType,
            TUInt8 aIndex,
            TUInt8 *aBuffer,
            TUInt32 aSize,
            TUInt32 aTimeout)
{
    return Host_CtrlRecv(
        aWorkspace,
        aBuffer,
        aDeviceAddress,
        USB_DEVICE_TO_HOST | USB_RECIPIENT_DEVICE,
        GET_DESCRIPTOR,
        (aType << 8)|(aIndex),
        0,
        aSize,
        aTimeout);
}

T_uezError Host_GetString(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt32 aIndex,
            TUInt8 *aBuffer,
            TUInt32 aSize,
            TUInt32 aTimeout)
{
    return Host_CtrlRecv(
        aWorkspace,
        aBuffer,
        aDeviceAddress,
        USB_DEVICE_TO_HOST | USB_RECIPIENT_DEVICE,
        GET_DESCRIPTOR,
        (3 << 8)|(aIndex),
        0,
        aSize,
        aTimeout);
}

T_uezError Host_BulkOut(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt8 aEndpoint,
            TUInt8 *aBuffer,
            TUInt32 aSize,
            TUInt32 aTimeout)
{
    T_uezError error;
    volatile HCED *hced = EDBulkOut;
//    T_LPC2478_USBHost_Workspace *p = (T_LPC2478_USBHost_Workspace *)aWorkspace;

    // Configure the bulk end point
    // with the proper end point and address
    hced->Control =
        (hced->Control & ~((0x7F<<0)|(0x7F<<7))) |
        (aDeviceAddress << 0) |
        ((aEndpoint & 0x7F) << 7);

    // Now process that end point
    error = Host_ProcessTD(aWorkspace, hced, TD_OUT, aBuffer, aSize, aTimeout);

    return error;
}

T_uezError Host_BulkIn(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt8 aEndpoint,
            TUInt8 *aBuffer,
            TUInt32 aSize,
            TUInt32 aTimeout)
{
    T_uezError error;
    volatile HCED *hced = EDBulkIn;
//    T_LPC2478_USBHost_Workspace *p = (T_LPC2478_USBHost_Workspace *)aWorkspace;

    // Configure the bulk end point
    // with the proper end point and address
    hced->Control =
        (hced->Control & ~((0x7F<<0)|(0x7F<<7))) |
        (aDeviceAddress << 0) |
        ((aEndpoint & 0x7F) << 7);

    // Now process that end point
    error = Host_ProcessTD(aWorkspace, hced, TD_IN, aBuffer, aSize, aTimeout);

    return error;
}

T_uezError Host_InterruptOut(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt8 aEndpoint,
            const TUInt8 *aBuffer,
            TUInt32 aSize,
            TUInt32 aTimeout)
{
    T_uezError error;
    volatile HCED *hced = EDBulkOut;
//    T_LPC2478_USBHost_Workspace *p = (T_LPC2478_USBHost_Workspace *)aWorkspace;

    // Configure the bulk end point
    // with the proper end point and address
    hced->Control =
        (hced->Control & ~((0x7F<<0)|(0x7F<<7))) |
        (aDeviceAddress << 0) |
        ((aEndpoint & 0x7F) << 7);

    // Now process that end point
    error = Host_ProcessTD(aWorkspace, hced, TD_OUT, (void *)aBuffer, aSize, aTimeout);

    return error;
}

T_uezError Host_InterruptIn(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt8 aEndpoint,
            TUInt8 *aBuffer,
            TUInt32 aSize,
            TUInt32 aTimeout)
{
    T_uezError error;
    volatile HCED *hced = EDBulkIn;
//    T_LPC2478_USBHost_Workspace *p = (T_LPC2478_USBHost_Workspace *)aWorkspace;

    // Configure the interrupt end point
    // with the proper end point and address
    hced->Control =
        (hced->Control & ~((0x7F<<0)|(0x7F<<7))) |
        (aDeviceAddress << 0) |
        ((aEndpoint & 0x7F) << 7);

    // Now process that end point
    error = Host_ProcessTD(aWorkspace, hced, TD_IN, aBuffer, aSize, aTimeout);

    return error;
}

T_uezError Host_SetConfiguration(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt32 aConfigurationNum)
{
    return Host_CtrlSend(
            aWorkspace,
            0,
            aDeviceAddress,
            USB_HOST_TO_DEVICE | USB_RECIPIENT_DEVICE,
            SET_CONFIGURATION,
            aConfigurationNum,
            0,
            0,
            TIMEOUT_STANDARD);
}

T_uezError Host_SetControlPacketSize(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt16 aPacketSize)
{
    PARAM_NOT_USED(aWorkspace);

    if (aPacketSize > 256)
        return UEZ_ERROR_ILLEGAL_PARAMETER;

    EDCtrl->Control = (aPacketSize << 16);

    return UEZ_ERROR_NONE;
}

T_uezError Host_ConfigureEndpoint(
        void *aWorkspace,
        TUInt8 aDeviceAddress,
        TUInt8 aEndpointAndInOut,   // bit 0x80 is set if IN
        TUInt16 aMaxPacketSize)
{
//    T_LPC2478_USBHost_Workspace *p = (T_LPC2478_USBHost_Workspace *)aWorkspace;

