FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_USBHost.c
    // For now, we'll set the one endpoint
    if (aEndpointAndInOut & 0x80) {
        EDBulkIn->Control =
            aDeviceAddress | // USB Address
            ((aEndpointAndInOut & 0x7F) << 7) | // Endpoint address
            (2 << 11) | // direction
            (aMaxPacketSize << 16);
    } else {
        EDBulkOut->Control =
            aDeviceAddress | // USB Address
            ((aEndpointAndInOut & 0x7F) << 7) | // Endpoint address
            (1 << 11) | // direction
            (aMaxPacketSize << 16);
    }

    return UEZ_ERROR_NONE;
}


void LPC2478_USBHost_PortA_Require(const T_LPC2478_USBHost_Settings *aSettings)
{
    static const T_LPC2478_PINSEL_ConfigList pinsDP1[] = {
            {GPIO_P0_29, 1}, // USB_D+1
    };
    static const T_LPC2478_PINSEL_ConfigList pinsDM1[] = {
            {GPIO_P0_30, 1}, // USB_D-1
    };
    static const T_LPC2478_PINSEL_ConfigList pinsCONNECT1[] = {
            {GPIO_P2_9,  1}, // USB_CONNECT1
    };
    static const T_LPC2478_PINSEL_ConfigList pinsUP_LED1[] = {
            {GPIO_P1_18, 1}, // USB_UP_LED1
    };
    static const T_LPC2478_PINSEL_ConfigList pinsINT1[] = {
            {GPIO_P1_27, 1}, // USB_INT1n
    };
    static const T_LPC2478_PINSEL_ConfigList pinsSCL1[] = {
            {GPIO_P1_28, 1}, // USB_SCL1
    };
    static const T_LPC2478_PINSEL_ConfigList pinsSDA1[] = {
            {GPIO_P1_29, 1}, // USB_SDA1
    };
    static const T_LPC2478_PINSEL_ConfigList pinsTX_E1[] = {
            {GPIO_P1_19, 1}, // USB_TX_E1
    };
    static const T_LPC2478_PINSEL_ConfigList pinsTX_DP1[] = {
            {GPIO_P1_20, 1}, // USB_TX_DP1
    };
    static const T_LPC2478_PINSEL_ConfigList pinsTX_DM1[] = {
            {GPIO_P1_21, 1}, // USB_TX_DM1
    };
    static const T_LPC2478_PINSEL_ConfigList pinsRCV1[] = {
            {GPIO_P1_22, 1}, // USB_RCV1
    };
    static const T_LPC2478_PINSEL_ConfigList pinsRX_DP1[] = {
            {GPIO_P1_23, 1}, // USB_RX_DP1
    };
    static const T_LPC2478_PINSEL_ConfigList pinsRX_DM1[] = {
            {GPIO_P1_24, 1}, // USB_RX_DM1
    };
    static const T_LPC2478_PINSEL_ConfigList pinsRX_LS1[] = {
            {GPIO_P1_25, 1}, // USB_LS1n
    };
    static const T_LPC2478_PINSEL_ConfigList pinsSSPND1[] = {
            {GPIO_P1_26, 1}, // USB_SSPND1n
    };
    static const T_LPC2478_PINSEL_ConfigList pinsPPWR1[] = {
            {GPIO_P1_19, 2}, // USB_PPWR1n
    };
    static const T_LPC2478_PINSEL_ConfigList pinsPWRD1[] = {
            {GPIO_P1_22, 2}, // USB_PWRD1
    };
    static const T_LPC2478_PINSEL_ConfigList pinsOVRCR1[] = {
            {GPIO_P1_27, 2}, // USB_OVRCR1n
    };
    static const T_LPC2478_PINSEL_ConfigList pinsHSTEN1[] = {
            {GPIO_P1_25, 2}, // USB_HSTEN1n
    };

    HAL_DEVICE_REQUIRE_ONCE();
    // Register USB Host driver ports for LPC24xx
    HALInterfaceRegister("USBHost:PortA",
            (T_halInterface *)&G_LPC2478_USBHost_Interface_PortA, 0, 0);
//    LPC2478_USBHost_VBUS_Require(aSettings->iVBUS);
    LPC2478_PINSEL_ConfigPin(aSettings->iDP, pinsDP1, ARRAY_COUNT(pinsDP1));
    LPC2478_PINSEL_ConfigPin(aSettings->iDM, pinsDM1, ARRAY_COUNT(pinsDM1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iCONNECT, pinsCONNECT1,
            ARRAY_COUNT(pinsCONNECT1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iUP_LED, pinsUP_LED1,
            ARRAY_COUNT(pinsUP_LED1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iINTn, pinsINT1,
            ARRAY_COUNT(pinsINT1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iSCL, pinsSCL1,
            ARRAY_COUNT(pinsSCL1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iSDA, pinsSDA1,
            ARRAY_COUNT(pinsSDA1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iTX_E, pinsTX_E1,
            ARRAY_COUNT(pinsTX_E1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iTX_DP, pinsTX_DP1,
            ARRAY_COUNT(pinsTX_DP1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iTX_DM, pinsTX_DM1,
            ARRAY_COUNT(pinsTX_DM1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iRCV, pinsRCV1,
            ARRAY_COUNT(pinsRCV1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iRX_DP, pinsRX_DP1,
            ARRAY_COUNT(pinsRX_DP1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iRX_DM, pinsRX_DM1,
            ARRAY_COUNT(pinsRX_DM1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iLSn, pinsRX_LS1,
            ARRAY_COUNT(pinsRX_LS1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iSSPNDn, pinsSSPND1,
            ARRAY_COUNT(pinsSSPND1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iPPWRn, pinsPPWR1,
            ARRAY_COUNT(pinsPPWR1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iPWRDn, pinsPWRD1,
            ARRAY_COUNT(pinsPWRD1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iOVRCRn, pinsOVRCR1,
            ARRAY_COUNT(pinsOVRCR1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iHSTENn, pinsHSTEN1,
            ARRAY_COUNT(pinsHSTEN1));
}

void LPC2478_USBHost_PortB_Require(const T_LPC2478_USBHost_Settings *aSettings)
{
    static const T_LPC2478_PINSEL_ConfigList pinsDP2[] = {
            {GPIO_P0_31, 1}, // USB_D+2
    };
    static const T_LPC2478_PINSEL_ConfigList pinsCONNECT2[] = {
            {GPIO_P0_14, 2}, // USB_CONNECT2
    };
    static const T_LPC2478_PINSEL_ConfigList pinsUP_LED2[] = {
            {GPIO_P0_13, 1}, // USB_UP_LED2
    };
    static const T_LPC2478_PINSEL_ConfigList pinsPPWR2[] = {
            {GPIO_P0_12, 1}, // USB_PPWR2n
    };
    static const T_LPC2478_PINSEL_ConfigList pinsPWRD2[] = {
            {GPIO_P1_30, 1}, // USB_PWRD2
    };
    static const T_LPC2478_PINSEL_ConfigList pinsOVRCR2[] = {
            {GPIO_P1_31, 1}, // USB_OVRCR2n
    };
    static const T_LPC2478_PINSEL_ConfigList pinsHSTEN2[] = {
            {GPIO_P0_14, 1}, // USB_HSTEN2n
    };
    HAL_DEVICE_REQUIRE_ONCE();
    // Register USB Host driver ports for LPC24xx
    HALInterfaceRegister("USBHost:PortB",
            (T_halInterface *)&G_LPC2478_USBHost_Interface_PortB, 0, 0);

//    LPC2478_USBHost_VBUS_Require(aSettings->iVBUS);
    LPC2478_PINSEL_ConfigPin(aSettings->iDP, pinsDP2, ARRAY_COUNT(pinsDP2));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iDM, 0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iCONNECT, pinsCONNECT2,
            ARRAY_COUNT(pinsCONNECT2));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iUP_LED, pinsUP_LED2,
            ARRAY_COUNT(pinsUP_LED2));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iINTn, 0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iSCL, 0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iSDA, 0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iTX_E, 0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iTX_DP, 0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iTX_DM, 0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iRCV, 0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iRX_DP, 0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iRX_DM, 0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iLSn, 0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iSSPNDn, 0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iPPWRn, pinsPPWR2,
            ARRAY_COUNT(pinsPPWR2));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iPWRDn, pinsPWRD2,
            ARRAY_COUNT(pinsPWRD2));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iOVRCRn, pinsOVRCR2,
            ARRAY_COUNT(pinsOVRCR2));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iHSTENn, pinsHSTEN2,
            ARRAY_COUNT(pinsHSTEN2));
}

const HAL_USBHost G_LPC2478_USBHost_Interface_PortA = {
    // T_halInterface iInterface
    {
        "LPC2478:USBHost:PortA",
        0x0100,
        LPC2478_USBHost_InitializeWorkspace_PortA,
        sizeof(T_LPC2478_USBHost_Workspace),
    },

    Host_SetCallbacks,
    Host_Init,
    Host_ResetPort,
    Host_ResetBuffers,
    Host_AllocBuffer,
    Host_ProcessTD,
    Host_GetState,

    Host_SetControlPacketSize,
    Host_SetAddress,
    Host_ConfigureEndpoint,
    Host_SetConfiguration,

    Host_Control,
    Host_GetDescriptor,
    Host_GetString,
    Host_BulkOut,
    Host_BulkIn,
    Host_InterruptOut,
    Host_InterruptIn,
};


const HAL_USBHost G_LPC2478_USBHost_Interface_PortB = {
    // T_halInterface iInterface
    {
        "LPC2478:USBHost:PortB",
        0x0100,
        LPC2478_USBHost_InitializeWorkspace_PortB,
        sizeof(T_LPC2478_USBHost_Workspace),
    },

    Host_SetCallbacks,
    Host_Init,
    Host_ResetPort,
    Host_ResetBuffers,
    Host_AllocBuffer,
    Host_ProcessTD,
    Host_GetState,

    Host_SetControlPacketSize,
    Host_SetAddress,
    Host_ConfigureEndpoint,
    Host_SetConfiguration,

    Host_Control,
    Host_GetDescriptor,
    Host_GetString,
    Host_BulkOut,
    Host_BulkIn,
    Host_InterruptOut,
    Host_InterruptIn,
};

/*-------------------------------------------------------------------------*
 * End of File:  LPC2478_USBHost.c
 *-------------------------------------------------------------------------*/
